from api import post_requests, preprocess_name

def post_checklist(endpoint, data):
    data["name"], data["surname"] = preprocess_name(data["name"], data["surname"])
    return post_requests(endpoint, data)

if __name__ == '__main__':
    data = {
        "name": "สุชญา",
        "surname": "ดำรงวัฒนะสุข",
        "tasks": {
            "ช่วงเช้า": ["วัดอัตราการเต้นของหัวใจ", "วัดความดันเลือด", "วัดระดับน้ำตาลในเลือด", "ตรวจแผลกดทับ", "ยาก่อน/หลังอาหาร"],
            # "ช่วงเช้า": ["วัดความดันเลือด", "วัดระดับน้ำตาลในเลือด", "ตรวจแผลกดทับ", "ยาก่อน/หลังอาหาร"],
            "ก่อนเที่ยง": ["วัดอัตราการเต้นของหัวใจ", "วัดความดันเลือด", "วัดระดับน้ำตาลในเลือด", "ตรวจแผลกดทับ", "ยาก่อน/หลังอาหาร"],
            "ช่วงกลางวัน": ["วัดอัตราการเต้นของหัวใจ", "วัดความดันเลือด", "วัดระดับน้ำตาลในเลือด", "ตรวจแผลกดทับ", "ยาก่อน/หลังอาหาร"],
            "ช่วงเย็น": ["วัดอัตราการเต้นของหัวใจ", "วัดความดันเลือด", "วัดระดับน้ำตาลในเลือด", "ตรวจแผลกดทับ", "ยาก่อน/หลังอาหาร"],
            # "ตอนค่ำ": ["วัดอัตราการเต้นของหัวใจ", "วัดความดันเลือด", "วัดระดับน้ำตาลในเลือด", "ตรวจแผลกดทับ", "ยาก่อน/หลังอาหาร"],
            "ตอนค่ำ": ["วัดความดันเลือด", "วัดระดับน้ำตาลในเลือด", "ตรวจแผลกดทับ", "ยาก่อน/หลังอาหาร"],
        }
    }
    # post_checklist("update/check/list")
    post_checklist("update/check/list/upsert", data)